import React from 'react';

import Qualification from './Level';
import './LevelList.css';
import LevelList from './LevelList';

import './H_style/H_style.css'

import LearningForm from './Learning_Form/Learning_Form'

import Information from './Information_box/Information'
import './Information_box/Information.css';

import ForEnterer from './ForEnterer/ForEnterer';
import './ForEnterer/ForEnterer.css';

import Contact from './Contact/Contact';
import E_mail from './Contact/E-mail';

function Main(){
    return (
        <div id = "main_part">
            <h3>Спеціальність:</h3>
            <h2>172 Телекомунікації та радіотехніка</h2>

            <h3>Кафедра</h3>
            <h1>Інформаційно-телекомунікаційних мереж</h1>
            <div class="margin_160" ></div>
            <h1>Опис професії</h1>
            <div class="margin_20" ></div>
            <h2>Кваліфікаційні рівні</h2>
            <div class="margin_20" ></div>
            <LevelList>
                <Qualification icon_I="I" level="Перший" name="Бакалаврський" />
                <Qualification icon_I="II" level="Другий" name="Магістрський" />
                <Qualification icon_I="III" level="Третій" name="Освітньо-науковий" />
            </LevelList>
            <div class="margin_45" ></div>
            <h2>Форми навчання</h2>
            <div class="margin_20" ></div>
            <LevelList>
                <LearningForm level="Форма навчання" name="Денна"/>
                <LearningForm level="Форма навчання" name="Заочна"/>
            </LevelList>
            <div class="margin_-5" ></div>
            <LevelList>
                <Information header="
                Унікальні специфічні знання, вміння та навички якими володіють випускники
                " content="
                Кафедра інформаційно-телекомунікаційних мереж здійснює підготовку фахівців у напрямку забезпечення користувачів послугами телекомунікаційних мереж та програмним забезпеченням їх функціонування. Випускники володіють знаннями, вміннями та навичками, ща дозволяє їм аналізувати та впроваджквати телекоунікаційні технології, розробляти програмне забезпечення прийому-передавання інформації та абонентського доступу до ресурсів телекомунікаційних мереж, виконувати моніторинг, проводити моделювання, системний аналіз, дослідження операцій, забезпечувати захист інформації в інформаційно-телекомунікаційному середовищі.
                "/> 
                <Information header="
                Теми дипломних робіт (основні напрямки магістерських досліджень)
                " content="
                Магістерські роботи направлені на дослідження в сфері удосконалення технологій надання послуг користувачам телекомунікаційних мерж шляхом аналізу, розрахунку та комп’ютерного моделювання. До напрямків робіт належать: алгоритмічне та програмне забезпечення захисту інформації в мобільних мережах; дослідження можливості підвищення якості послуг в супутникових мережах зв’язку; автоматизація технологій тестування працездатності базових станцій систем стільникового зв’язку; гетерогенні телекомунікаційні мережі наджання мультимедійних послуг.
                "/> 
                <Information header="
                Ким можуть працювати випускники відповідно до державного класифікатора професій
                " content="
                Випускники ІТС можуть працювати в якості керівників середнього та нижчого рівнів управління, спеціалістів виробничих підрозділів підприємств, консультантів з інформаційного забезпечення. Бакалаври можуть працювати на інженерних посадах телекомунікаційних компаній та організацій з експлуатації та обслуговування апаратури. Магістри можуть працювати на організаційних науково-дослідних та керівних посадах в галузі телекомунікацій і виконувати наукові дослідження та розробки інформаційно-телекомунікаційних технологій, приймати тактичні та стратегічні рішення з технологічних задач роботи обладнання систем та мереж зв’язку.
                "/> 
                <Information header="
                Де працюють випускники
                " content="
                Випускники ІТС працюють в установах державної та недержавної форм власності: ВАТ “Укртелеком”, „Датагруп”, МТС, „Київстар”, ЗАТ “УкрСат”, „Голден Телеком”, “Воля Кабель”, “Моторола”, „HUAWEY TECHNOLOGIES”, банківських установах – “Банкомзв’язок”, в компаніях з інформаційними послугами ТОВ “Комп’ютер та сервіс”, ТОВ “Телеком – дистрибюшен”, СП ТОВ “Інтернешнл Телеком’юнікешен Компані”, НДЦ „Квазар” та в багатьох інших.
                "/> 
                <Information header="
                Місця проходження практики
                " content="
                ВАТ Укртелеком, ТОВ “Голден Телеком”, ЗАТ ”ДАТАГРУП”, ЗАТ “Київстар Дж.Ес.Ем.”, ЗАТ “Український Мобільний Зв’язок”, ТОВ “Глобал Телеком”, ВАТ “Бамкомзв’язок”, АТ Банк “ТАВРИКА”, Huawei Technologies Co., LTD., “ІНВЕКС Телеком” т.і. 
                "/> 
                
                <Information header="
                Додаткова освіта: підвищення кваліфікації, друга вища, тренінги, тощо
                " content="
                ІТС готує фахівців за другою вищою освітою за спеціальністю: Інформаційно-комунікаційні технології​
                "/> 
            </LevelList>
            <div class="margin_195" ></div>
            <h1>Інформація для абітурієнтів</h1>
            <div class="margin_36" ></div>
            <LevelList>
                    <ForEnterer icon_image="I" name="Вступ на 1-й курс" level="за сертифікатами ЗНО" />
                    <ForEnterer icon_image="I" name="Вступ на 1-й курс" level="за дипломом молодшого спеціаліста" />
                    <ForEnterer icon_image="I" name="Вступ на 5-й курс" level="" />
                    <ForEnterer icon_image="I" name="Офіційні документи" level="" />
            </LevelList>
            <div class="margin_45" ></div>
            <h2>Контакти вибіркової комісії ІТС</h2>
            <div class="margin_20" ></div>
            <h3><Contact name= "Телефон відбіркової комісії ІТС" telephone_Number="(068)-357-08-44"/></h3>
            <div class="margin_-25" ></div>
            <h3><E_mail name= "Адреса електронної пошти відбіркової комісії ІТС" e_mail = "novikov1967@ukr.net"/></h3>
            <a href="#">Поширені запитання (FAQ)</a>
            <div class="margin_195" ></div>
            <div>
                <imag>

                </imag>
                <div>
                    <h2>
                        Подвійний диплом
                    </h2>
                    <h3>
                        Єдина магістерська програма
                    </h3>
                    <p>
                        У рамках Європейської програми магістратури Distributed Systems Engineering, Інститут телекомунікаційних систем Національного технічного університету України «Київський політехнічний інститут» (НТУУ «КПІ») та факультет Інформатики Технічного університету м. Дрездена (ТУД) пропонують єдину міжнародну програму «Інженерія розподілених систем».
                    </p>
                </div>
                <a className = "readMore" href= "#"> Читати докладніше </a>
            </div>
        </div>
    )
}

export default Main;


/*


*/